combat-quarkus-vs-spring/quarkus-echo/src/main/taurus/script_taurus_quarkus_echo.yaml
execution:
- concurrency: 20
  ramp-up: 5s
  hold-for: 2m
  scenario: Simple
 

#scenarios:
#  Simple :
#    default-address: "https://www.wordreference.com"
#    requests: 
#      - label: "/definicion/ocurre"
#        url: "/definicion/ocurre"
#        method: GET

scenarios:
  Simple :
    default-address: "http://${HOST_DOCKER_IP}:8081"
    requests: 
      - label: "Quarkus Echo"
        url: "/echo/ualter"
        method: GET